In [1]:
import pandas as pd

In [14]:
names = ['Bob', 'Jessica', 'Mary', 'John', 'Mel']
birth = [968, 155, 77, 578, 973]
custom = [1, 5, 25, 13, 23232]

In [15]:
BabyDataSet= list(zip(names, birth))

In [26]:
df = pd.DataFrame(data=BabyDataSet, columns=['Names', 'Birth'])

In [27]:
df

     Names  Birth
0      Bob    968
1  Jessica    155
2     Mary     77
3     John    578
4      Mel    973

In [28]:
df.head()

     Names  Birth
0      Bob    968
1  Jessica    155
2     Mary     77
3     John    578
4      Mel    973

In [29]:
# 열 타입의 data type 정보
df.dtypes

Names    object
Birth     int64
dtype: object

In [30]:
# 행의 형태 정보
df.index

RangeIndex(start=0, stop=5, step=1)

In [31]:
# 데이터 프레임의 열 정보 간략하게 요약
df.columns

Index(['Names', 'Birth'], dtype='object')

In [33]:
df['Names']

0        Bob
1    Jessica
2       Mary
3       John
4        Mel
Name: Names, dtype: object

In [36]:
df[2:4]

  Names  Birth
2  Mary     77
3  John    578

In [38]:
df[df['Birth'] > 100]

     Names  Birth
0      Bob    968
1  Jessica    155
3     John    578
4      Mel    973

In [39]:
print(df['Birth'] > 100)

0     True
1     True
2    False
3     True
4     True
Name: Birth, dtype: bool

In [43]:
# 각 열들의 데이터 타입을 체크한 뒤, 연산이 가능한 열의 평균값만을 반환
df['Birth'].mean()

550.2

In [44]:
df.mean()

C:\Users\chaeyun\AppData\Local\Temp/ipykernel_36880/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

Birth    550.2
dtype: float64